#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```
Success! The configuration is valid.


```

</details>

#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```
terraform

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # module.repository["se-services"].github_branch.branch["develop"] has changed
  ~ resource "github_branch" "branch" {
      ~ etag          = "W/\"d04967741e1035553e51fee43725cd6f944255f95880f9978fd138fd00b660e1\"" -> "W/\"90ba3dae56a626214a9f22be732fbd8ac7b32b733c881033533602b547718c78\""
        id            = "se-services:develop"
        # (6 unchanged attributes hidden)
    }

  # module.repository["tool-simulation"].github_branch.branch["develop"] has changed
  ~ resource "github_branch" "branch" {
      ~ etag          = "W/\"c4737c39abafaf924e104d1cda2a7d24c0ae56035060de6e2b01edf19a504cf2\"" -> "W/\"32ffd452aacf3895bff7f921a2ea47dab102d702de736f2d5614c684331bf61b\""
        id            = "tool-simulation:develop"
      ~ sha           = "18453723d99609bb285326f2d17011f369bedb2c" -> "bbd757b9367fa73a4ff0bb714af1cc14008c405c"
        # (5 unchanged attributes hidden)
    }

  # module.repository["website"].github_branch.branch["staging"] has changed
  ~ resource "github_branch" "branch" {
      ~ etag          = "W/\"bc3fe4f875faf5ded891fda74a10ec4c111ad33475dcbca92b843cbcc7ff78a8\"" -> "W/\"1218b7806cd483210b8615723fea3341a8e3725172a9e8255a326da02f7bdb01\""
        id            = "website:staging"
        # (5 unchanged attributes hidden)
    }

  # module.repository_lib_template["rust"].github_branch.branch["develop"] has changed
  ~ resource "github_branch" "branch" {
      ~ etag          = "W/\"a8f8e9c8fd08da40520830a4aec4688387635e9b6b49139ddd0e7a0e835a7bdb\"" -> "W/\"937d84610e36c33735ad9c4fb429eba8734def115f9ce099499d552da5dff44d\""
        id            = "lib-template-rust:develop"
      ~ sha           = "42ff6b06a3c6ca15f50ef895be67adda30af4999" -> "5a8bc2b194ad5c6cc3de952a7a30a1f4ac94d5d8"
        # (5 unchanged attributes hidden)
    }

  # module.repository_rust_lib["router"].github_branch.branch["develop"] has changed
  ~ resource "github_branch" "branch" {
      ~ etag          = "W/\"d8872407153a98780eb08bdeebc48a38fa90ee64fc59fd2426f8c4449422809c\"" -> "W/\"afde9042310a362071d3e87e896e3c425c892bed00271b1f90657afeb6b85066\""
        id            = "lib-router:develop"
      ~ sha           = "0b4335a9552896d35b2d35ce3816def23dd61fb6" -> "c9c88ace24720ec6bc9391438a8c8b57eedba38b"
        # (5 unchanged attributes hidden)
    }

  # module.repository_rust_svc["cargo"].github_branch.branch["develop"] has changed
  ~ resource "github_branch" "branch" {
      ~ etag          = "W/\"c05f55597c1d2d9c03a8a256babc34a5b427e809f37a10ec67509caedaf98e05\"" -> "W/\"13aec5092a62a93bf738095a32fd22ef15a82b76824a07d1264883f28f542a91\""
        id            = "svc-cargo:develop"
      ~ sha           = "5bae5af7606f9c138b0d8d6ef6f57b148217cdb0" -> "87105e393502372312116ffa6e7bb7d072608291"
        # (4 unchanged attributes hidden)
    }

  # module.repository_rust_svc["pricing"].github_branch.branch["develop"] has changed
  ~ resource "github_branch" "branch" {
      ~ etag          = "W/\"890ed2352ad6a25453d83e69ac5bece1f715185969251c4995cec9538080ef42\"" -> "W/\"84b5a4b5479e8d65323ca9a69b7c8fefdb6fd270e38a2824ad724d200dea7902\""
        id            = "svc-pricing:develop"
      ~ sha           = "e066d426498408350072202cfbf2308427cbe9cc" -> "e1faeb4eb30eaa342a4d64a7ba4a5549cc472cd2"
        # (4 unchanged attributes hidden)
    }

  # module.repository_rust_svc["scheduler"].github_branch.branch["develop"] has changed
  ~ resource "github_branch" "branch" {
      ~ etag          = "W/\"c74bb301a436abdcb25279ba23341727beb6c082dfea2eb658c220caae266b7d\"" -> "W/\"bcede4457be50ac6421925780587543005f408e07cf63cdd9a75f1960ac00e57\""
        id            = "svc-scheduler:develop"
      ~ sha           = "9d469339732e6ba4801cb137e6cfa06656a557ee" -> "9fb81618efd6e25e92dd083a78860726b845fe38"
        # (5 unchanged attributes hidden)
    }

  # module.repository_rust_svc["storage"].github_branch.branch["develop"] has changed
  ~ resource "github_branch" "branch" {
      ~ etag          = "W/\"98ffeb6b85f9c19997358c349c780991cf12db6ece60ec8dd8a5d6db3da91df0\"" -> "W/\"3523851975f832835a5d7a66335e3f883d571066915e2f6bc5566b58ad75a632\""
        id            = "svc-storage:develop"
      ~ sha           = "9f30a88ac98d8f00a0e786137a1253eb2dff9fed" -> "5af709232d2acc86f63b9fa8ed626ecb18ab9b95"
        # (5 unchanged attributes hidden)
    }

  # module.repository_svc_template["python"].github_branch.branch["develop"] has changed
  ~ resource "github_branch" "branch" {
      ~ etag          = "W/\"4c5a35f2304a1e0b839aed60437a69d474410bdae56d1cd0ec0fa98b76adae51\"" -> "W/\"dad7e8a8edfc3c538aa55e0da3391935a7ee92ce97c1a9d2a664e2b46c1e62dc\""
        id            = "svc-template-python:develop"
        # (6 unchanged attributes hidden)
    }

  # module.repository_svc_template["rust"].github_branch.branch["develop"] has changed
  ~ resource "github_branch" "branch" {
      ~ etag          = "W/\"50f4ca836d383039e37e5ebcf6aee830c24223f61c2be4ebe998526fced7890f\"" -> "W/\"ed8400971cd7550817facf55daeee403730df13afdbc0f11fce97d80f40f6b3c\""
        id            = "svc-template-rust:develop"
      ~ sha           = "a8403c69bc67deab9d00ea320521ff095a1e397a" -> "b871a452784e1662797d8adb8975b16afafb7e3d"
        # (5 unchanged attributes hidden)
    }

  # module.repository_svc_template["typescript"].github_branch.branch["develop"] has changed
  ~ resource "github_branch" "branch" {
      ~ etag          = "W/\"9fd269cd70a4dfff903a30bf6b8f0e37e569759baba747770986e807682b222a\"" -> "W/\"5afee303ff15ac138043cbe37b34acf8db43280f072f3f7a741a4f4340a5cd20\""
        id            = "svc-template-typescript:develop"
        # (6 unchanged attributes hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
  - destroy

Terraform will perform the following actions:

  # module.repository["benchmarks"].github_branch_protection.protection["main"] will be updated in-place
  ~ resource "github_branch_protection" "protection" {
        id                              = "BPR_kwDOHzRWt84Bqv9O"
        # (10 unchanged attributes hidden)

      ~ required_pull_request_reviews {
          ~ pull_request_bypassers          = [
              + "A_kwHOBayTi84AAq0w",
            ]
            # (5 unchanged attributes hidden)
        }

        # (1 unchanged block hidden)
    }

  # module.repository["cla-bot"].github_branch_protection.protection["main"] will be updated in-place
  ~ resource "github_branch_protection" "protection" {
        id                              = "BPR_kwDOHTAbhc4BmmRb"
        # (10 unchanged attributes hidden)

      ~ required_pull_request_reviews {
          ~ pull_request_bypassers          = [
              + "A_kwHOBayTi84AAq0w",
            ]
            # (5 unchanged attributes hidden)
        }

        # (1 unchanged block hidden)
    }

  # module.repository["se-services"].github_branch_protection.protection["develop"] will be updated in-place
  ~ resource "github_branch_protection" "protection" {
        id                              = "BPR_kwDOH6H84M4BtBZe"
        # (10 unchanged attributes hidden)

      ~ required_pull_request_reviews {
          ~ pull_request_bypassers          = [
              + "A_kwHOBayTi84AAq0w",
            ]
            # (5 unchanged attributes hidden)
        }

        # (1 unchanged block hidden)
    }

  # module.repository["se-services"].github_branch_protection.protection["main"] will be updated in-place
  ~ resource "github_branch_protection" "protection" {
        id                              = "BPR_kwDOH6H84M4BtBZp"
        # (10 unchanged attributes hidden)

      ~ required_pull_request_reviews {
          ~ pull_request_bypassers          = [
              + "A_kwHOBayTi84AAq0w",
            ]
            # (5 unchanged attributes hidden)
        }

        # (1 unchanged block hidden)
    }

  # module.repository["tool-simulation"].github_branch_protection.protection["develop"] will be updated in-place
  ~ resource "github_branch_protection" "protection" {
        id                              = "BPR_kwDOH_Z3b84Bup88"
        # (10 unchanged attributes hidden)

      ~ required_pull_request_reviews {
          ~ pull_request_bypassers          = [
              + "A_kwHOBayTi84AAq0w",
            ]
            # (5 unchanged attributes hidden)
        }

        # (1 unchanged block hidden)
    }

  # module.repository["tool-simulation"].github_branch_protection.protection["main"] will be updated in-place
  ~ resource "github_branch_protection" "protection" {
        id                              = "BPR_kwDOH_Z3b84Bup8-"
        # (10 unchanged attributes hidden)

      ~ required_pull_request_reviews {
          ~ pull_request_bypassers          = [
              + "A_kwHOBayTi84AAq0w",
            ]
            # (5 unchanged attributes hidden)
        }

        # (1 unchanged block hidden)
    }

  # module.repository["tools"].github_branch_protection.protection["main"] will be updated in-place
  ~ resource "github_branch_protection" "protection" {
        id                              = "BPR_kwDOHn-Jf84BmmRe"
        # (10 unchanged attributes hidden)

      ~ required_pull_request_reviews {
          ~ pull_request_bypassers          = [
              + "A_kwHOBayTi84AAq0w",
            ]
            # (5 unchanged attributes hidden)
        }

        # (1 unchanged block hidden)
    }

  # module.repository["website"].github_branch_protection.protection["main"] will be updated in-place
  ~ resource "github_branch_protection" "protection" {
        id                              = "BPR_kwDOGdyvzM4BiRcN"
        # (10 unchanged attributes hidden)

      ~ required_pull_request_reviews {
          ~ pull_request_bypassers          = [
              + "A_kwHOBayTi84AAq0w",
            ]
            # (5 unchanged attributes hidden)
        }

        # (1 unchanged block hidden)
    }

  # module.repository["website"].github_branch_protection.protection["staging"] will be updated in-place
  ~ resource "github_branch_protection" "protection" {
        id                              = "BPR_kwDOGdyvzM4BiRcL"
        # (10 unchanged attributes hidden)

      ~ required_pull_request_reviews {
          ~ pull_request_bypassers          = [
              + "A_kwHOBayTi84AAq0w",
            ]
            # (5 unchanged attributes hidden)
        }

        # (1 unchanged block hidden)
    }

  # module.repository_lib_template["rust"].github_branch_protection.protection["develop"] will be updated in-place
  ~ resource "github_branch_protection" "protection" {
        id                              = "BPR_kwDOHwJLh84BqmYF"
        # (10 unchanged attributes hidden)

      ~ required_pull_request_reviews {
          ~ pull_request_bypassers          = [
              + "A_kwHOBayTi84AAq0w",
            ]
            # (5 unchanged attributes hidden)
        }

        # (1 unchanged block hidden)
    }

  # module.repository_lib_template["rust"].github_branch_protection.protection["main"] will be updated in-place
  ~ resource "github_branch_protection" "protection" {
        id                              = "BPR_kwDOHwJLh84BqmYD"
        # (10 unchanged attributes hidden)

      ~ required_pull_request_reviews {
          ~ pull_request_bypassers          = [
              + "A_kwHOBayTi84AAq0w",
            ]
            # (5 unchanged attributes hidden)
        }

        # (1 unchanged block hidden)
    }

  # module.repository_rust_lib["router"].github_branch.branch["develop"] will be destroyed
  # (because key ["develop"] is not in for_each map)
  - resource "github_branch" "branch" {
      - branch        = "develop" -> null
      - etag          = "W/\"afde9042310a362071d3e87e896e3c425c892bed00271b1f90657afeb6b85066\"" -> null
      - id            = "lib-router:develop" -> null
      - ref           = "refs/heads/develop" -> null
      - repository    = "lib-router" -> null
      - sha           = "c9c88ace24720ec6bc9391438a8c8b57eedba38b" -> null
      - source_branch = "main" -> null
      - source_sha    = "0e0c9c37b55e0eb9cad4fa5456134a58df941703" -> null
    }

  # module.repository_rust_lib["router"].github_branch.branch["main"] will be created
  + resource "github_branch" "branch" {
      + branch        = "main"
      + etag          = (known after apply)
      + id            = (known after apply)
      + ref           = (known after apply)
      + repository    = "lib-router"
      + sha           = (known after apply)
      + source_branch = "develop"
      + source_sha    = (known after apply)
    }

  # module.repository_rust_lib["router"].github_branch_protection.protection["develop"] will be updated in-place
  ~ resource "github_branch_protection" "protection" {
        id                              = "BPR_kwDOHyi9o84Bqidv"
        # (10 unchanged attributes hidden)

      ~ required_pull_request_reviews {
          ~ pull_request_bypassers          = [
              + "A_kwHOBayTi84AAq0w",
            ]
            # (5 unchanged attributes hidden)
        }

        # (1 unchanged block hidden)
    }

  # module.repository_rust_lib["router"].github_branch_protection.protection["main"] will be updated in-place
  ~ resource "github_branch_protection" "protection" {
        id                              = "BPR_kwDOHyi9o84Bqid1"
        # (10 unchanged attributes hidden)

      ~ required_pull_request_reviews {
          ~ pull_request_bypassers          = [
              + "A_kwHOBayTi84AAq0w",
            ]
            # (5 unchanged attributes hidden)
        }

        # (1 unchanged block hidden)
    }

  # module.repository_rust_svc["cargo"].github_branch.branch["develop"] will be destroyed
  # (because key ["develop"] is not in for_each map)
  - resource "github_branch" "branch" {
      - branch        = "develop" -> null
      - etag          = "W/\"13aec5092a62a93bf738095a32fd22ef15a82b76824a07d1264883f28f542a91\"" -> null
      - id            = "svc-cargo:develop" -> null
      - ref           = "refs/heads/develop" -> null
      - repository    = "svc-cargo" -> null
      - sha           = "87105e393502372312116ffa6e7bb7d072608291" -> null
      - source_branch = "main" -> null
    }

  # module.repository_rust_svc["cargo"].github_branch.branch["main"] will be created
  + resource "github_branch" "branch" {
      + branch        = "main"
      + etag          = (known after apply)
      + id            = (known after apply)
      + ref           = (known after apply)
      + repository    = "svc-cargo"
      + sha           = (known after apply)
      + source_branch = "develop"
      + source_sha    = (known after apply)
    }

  # module.repository_rust_svc["cargo"].github_branch_protection.protection["develop"] will be updated in-place
  ~ resource "github_branch_protection" "protection" {
        id                              = "BPR_kwDOH_aGzM4Bu98o"
        # (10 unchanged attributes hidden)

      ~ required_pull_request_reviews {
          ~ pull_request_bypassers          = [
              + "A_kwHOBayTi84AAq0w",
            ]
            # (5 unchanged attributes hidden)
        }

        # (1 unchanged block hidden)
    }

  # module.repository_rust_svc["cargo"].github_branch_protection.protection["main"] will be updated in-place
  ~ resource "github_branch_protection" "protection" {
        id                              = "BPR_kwDOH_aGzM4Bu98q"
        # (10 unchanged attributes hidden)

      ~ required_pull_request_reviews {
          ~ pull_request_bypassers          = [
              + "A_kwHOBayTi84AAq0w",
            ]
            # (5 unchanged attributes hidden)
        }

        # (1 unchanged block hidden)
    }

  # module.repository_rust_svc["pricing"].github_branch.branch["develop"] will be destroyed
  # (because key ["develop"] is not in for_each map)
  - resource "github_branch" "branch" {
      - branch        = "develop" -> null
      - etag          = "W/\"84b5a4b5479e8d65323ca9a69b7c8fefdb6fd270e38a2824ad724d200dea7902\"" -> null
      - id            = "svc-pricing:develop" -> null
      - ref           = "refs/heads/develop" -> null
      - repository    = "svc-pricing" -> null
      - sha           = "e1faeb4eb30eaa342a4d64a7ba4a5549cc472cd2" -> null
      - source_branch = "main" -> null
    }

  # module.repository_rust_svc["pricing"].github_branch.branch["main"] will be created
  + resource "github_branch" "branch" {
      + branch        = "main"
      + etag          = (known after apply)
      + id            = (known after apply)
      + ref           = (known after apply)
      + repository    = "svc-pricing"
      + sha           = (known after apply)
      + source_branch = "develop"
      + source_sha    = (known after apply)
    }

  # module.repository_rust_svc["pricing"].github_branch_protection.protection["develop"] will be updated in-place
  ~ resource "github_branch_protection" "protection" {
        id                              = "BPR_kwDOICuHTM4Bvld_"
        # (10 unchanged attributes hidden)

      ~ required_pull_request_reviews {
          ~ pull_request_bypassers          = [
              + "A_kwHOBayTi84AAq0w",
            ]
            # (5 unchanged attributes hidden)
        }

        # (1 unchanged block hidden)
    }

  # module.repository_rust_svc["pricing"].github_branch_protection.protection["main"] will be updated in-place
  ~ resource "github_branch_protection" "protection" {
        id                              = "BPR_kwDOICuHTM4BvleC"
        # (10 unchanged attributes hidden)

      ~ required_pull_request_reviews {
          ~ pull_request_bypassers          = [
              + "A_kwHOBayTi84AAq0w",
            ]
            # (5 unchanged attributes hidden)
        }

        # (1 unchanged block hidden)
    }

  # module.repository_rust_svc["scheduler"].github_branch.branch["develop"] will be destroyed
  # (because key ["develop"] is not in for_each map)
  - resource "github_branch" "branch" {
      - branch        = "develop" -> null
      - etag          = "W/\"bcede4457be50ac6421925780587543005f408e07cf63cdd9a75f1960ac00e57\"" -> null
      - id            = "svc-scheduler:develop" -> null
      - ref           = "refs/heads/develop" -> null
      - repository    = "svc-scheduler" -> null
      - sha           = "9fb81618efd6e25e92dd083a78860726b845fe38" -> null
      - source_branch = "main" -> null
      - source_sha    = "82ccb60c7931f4ce332aa3c02f2bd9ede7a798e4" -> null
    }

  # module.repository_rust_svc["scheduler"].github_branch.branch["main"] will be created
  + resource "github_branch" "branch" {
      + branch        = "main"
      + etag          = (known after apply)
      + id            = (known after apply)
      + ref           = (known after apply)
      + repository    = "svc-scheduler"
      + sha           = (known after apply)
      + source_branch = "develop"
      + source_sha    = (known after apply)
    }

  # module.repository_rust_svc["scheduler"].github_branch_protection.all["svc-scheduler"] will be updated in-place
  ~ resource "github_branch_protection" "all" {
        id                              = "BPR_kwDOHyi9hc4Bqidq"
      ~ pattern                         = ".*" -> "*"
        # (9 unchanged attributes hidden)
    }

  # module.repository_rust_svc["scheduler"].github_branch_protection.protection["develop"] will be updated in-place
  ~ resource "github_branch_protection" "protection" {
        id                              = "BPR_kwDOHyi9hc4Bqidr"
        # (10 unchanged attributes hidden)

      ~ required_pull_request_reviews {
          ~ pull_request_bypassers          = [
              + "A_kwHOBayTi84AAq0w",
            ]
            # (5 unchanged attributes hidden)
        }

        # (1 unchanged block hidden)
    }

  # module.repository_rust_svc["scheduler"].github_branch_protection.protection["main"] will be updated in-place
  ~ resource "github_branch_protection" "protection" {
        id                              = "BPR_kwDOHyi9hc4Bqidt"
        # (10 unchanged attributes hidden)

      ~ required_pull_request_reviews {
          ~ pull_request_bypassers          = [
              + "A_kwHOBayTi84AAq0w",
            ]
            # (5 unchanged attributes hidden)
        }

        # (1 unchanged block hidden)
    }

  # module.repository_rust_svc["storage"].github_branch.branch["develop"] will be destroyed
  # (because key ["develop"] is not in for_each map)
  - resource "github_branch" "branch" {
      - branch        = "develop" -> null
      - etag          = "W/\"3523851975f832835a5d7a66335e3f883d571066915e2f6bc5566b58ad75a632\"" -> null
      - id            = "svc-storage:develop" -> null
      - ref           = "refs/heads/develop" -> null
      - repository    = "svc-storage" -> null
      - sha           = "5af709232d2acc86f63b9fa8ed626ecb18ab9b95" -> null
      - source_branch = "main" -> null
      - source_sha    = "d2aa67a6683cfe7aaf446ead2cc19531b03cc539" -> null
    }

  # module.repository_rust_svc["storage"].github_branch.branch["main"] will be created
  + resource "github_branch" "branch" {
      + branch        = "main"
      + etag          = (known after apply)
      + id            = (known after apply)
      + ref           = (known after apply)
      + repository    = "svc-storage"
      + sha           = (known after apply)
      + source_branch = "develop"
      + source_sha    = (known after apply)
    }

  # module.repository_rust_svc["storage"].github_branch_protection.protection["develop"] will be updated in-place
  ~ resource "github_branch_protection" "protection" {
        id                              = "BPR_kwDOHyi9jc4BqieG"
        # (10 unchanged attributes hidden)

      ~ required_pull_request_reviews {
          ~ pull_request_bypassers          = [
              + "A_kwHOBayTi84AAq0w",
            ]
            # (5 unchanged attributes hidden)
        }

        # (1 unchanged block hidden)
    }

  # module.repository_rust_svc["storage"].github_branch_protection.protection["main"] will be updated in-place
  ~ resource "github_branch_protection" "protection" {
        id                              = "BPR_kwDOHyi9jc4BqieF"
        # (10 unchanged attributes hidden)

      ~ required_pull_request_reviews {
          ~ pull_request_bypassers          = [
              + "A_kwHOBayTi84AAq0w",
            ]
            # (5 unchanged attributes hidden)
        }

        # (1 unchanged block hidden)
    }

  # module.repository_svc_template["python"].github_branch_protection.protection["develop"] will be updated in-place
  ~ resource "github_branch_protection" "protection" {
        id                              = "BPR_kwDOHrbxrc4BqmXs"
        # (10 unchanged attributes hidden)

      ~ required_pull_request_reviews {
          ~ pull_request_bypassers          = [
              + "A_kwHOBayTi84AAq0w",
            ]
            # (5 unchanged attributes hidden)
        }

        # (1 unchanged block hidden)
    }

  # module.repository_svc_template["python"].github_branch_protection.protection["main"] will be updated in-place
  ~ resource "github_branch_protection" "protection" {
        id                              = "BPR_kwDOHrbxrc4BqmXr"
        # (10 unchanged attributes hidden)

      ~ required_pull_request_reviews {
          ~ pull_request_bypassers          = [
              + "A_kwHOBayTi84AAq0w",
            ]
            # (5 unchanged attributes hidden)
        }

        # (1 unchanged block hidden)
    }

  # module.repository_svc_template["rust"].github_branch_protection.protection["develop"] will be updated in-place
  ~ resource "github_branch_protection" "protection" {
        id                              = "BPR_kwDOHn-JXc4BqmXz"
        # (10 unchanged attributes hidden)

      ~ required_pull_request_reviews {
          ~ pull_request_bypassers          = [
              + "A_kwHOBayTi84AAq0w",
            ]
            # (5 unchanged attributes hidden)
        }

        # (1 unchanged block hidden)
    }

  # module.repository_svc_template["rust"].github_branch_protection.protection["main"] will be updated in-place
  ~ resource "github_branch_protection" "protection" {
        id                              = "BPR_kwDOHn-JXc4Bqprl"
        # (10 unchanged attributes hidden)

      ~ required_pull_request_reviews {
          ~ pull_request_bypassers          = [
              + "A_kwHOBayTi84AAq0w",
            ]
            # (5 unchanged attributes hidden)
        }

        # (1 unchanged block hidden)
    }

  # module.repository_svc_template["typescript"].github_branch_protection.protection["develop"] will be updated in-place
  ~ resource "github_branch_protection" "protection" {
        id                              = "BPR_kwDOHtu-d84BqmXu"
        # (10 unchanged attributes hidden)

      ~ required_pull_request_reviews {
          ~ pull_request_bypassers          = [
              + "A_kwHOBayTi84AAq0w",
            ]
            # (5 unchanged attributes hidden)
        }

        # (1 unchanged block hidden)
    }

  # module.repository_svc_template["typescript"].github_branch_protection.protection["main"] will be updated in-place
  ~ resource "github_branch_protection" "protection" {
        id                              = "BPR_kwDOHtu-d84BqmXx"
        # (10 unchanged attributes hidden)

      ~ required_pull_request_reviews {
          ~ pull_request_bypassers          = [
              + "A_kwHOBayTi84AAq0w",
            ]
            # (5 unchanged attributes hidden)
        }

        # (1 unchanged block hidden)
    }

  # module.repository_tf["github"].github_branch_protection.protection["main"] will be updated in-place
  ~ resource "github_branch_protection" "protection" {
        id                              = "BPR_kwDOG6VIns4BpLGe"
        # (10 unchanged attributes hidden)

      ~ required_pull_request_reviews {
          ~ pull_request_bypassers          = [
              + "A_kwHOBayTi84AAq0w",
            ]
            # (5 unchanged attributes hidden)
        }

        # (1 unchanged block hidden)
    }

Plan: 5 to add, 29 to change, 5 to destroy.

Changes to Outputs:
  - repositories = {
      - benchmarks      = {
          - branch         = {}
          - branch_default = {
              - branch     = "main"
              - id         = "benchmarks"
              - repository = "benchmarks"
            }
          - repository     = {
              - allow_auto_merge                        = false
              - allow_merge_commit                      = true
              - allow_rebase_merge                      = true
              - allow_squash_merge                      = true
              - archive_on_destroy                      = null
              - archived                                = false
              - auto_init                               = true
              - branches                                = [
                  - {
                      - name      = "am-smith/dw-354/final-cleanup-click-to"
                      - protected = false
                    },
                  - {
                      - name      = "main"
                      - protected = true
                    },
                  - {
                      - name      = "owlot-test"
                      - protected = true
                    },
                ]
              - default_branch                          = "main"
              - delete_branch_on_merge                  = true
              - description                             = "In-house benchmarks for various frameworks."
              - etag                                    = "W/\"736ac1454337fc8aec8826ac1e89691763c49b05058fd1794f731d74ce4d8740\""
              - full_name                               = "Arrow-air/benchmarks"
              - git_clone_url                           = "git://github.com/Arrow-air/benchmarks.git"
              - gitignore_template                      = null
              - has_downloads                           = false
              - has_issues                              = true
              - has_projects                            = true
              - has_wiki                                = true
              - homepage_url                            = ""
              - html_url                                = "https://github.com/Arrow-air/benchmarks"
              - http_clone_url                          = "https://github.com/Arrow-air/benchmarks.git"
              - id                                      = "benchmarks"
              - ignore_vulnerability_alerts_during_read = null
              - is_template                             = false
              - license_template                        = null
              - merge_commit_message                    = "PR_TITLE"
              - merge_commit_title                      = "MERGE_MESSAGE"
              - name                                    = "benchmarks"
              - node_id                                 = "R_kgDOHzRWtw"
              - pages                                   = []
              - private                                 = false
              - repo_id                                 = 523523767
              - squash_merge_commit_message             = "COMMIT_MESSAGES"
              - squash_merge_commit_title               = "COMMIT_OR_PR_TITLE"
              - ssh_clone_url                           = "git@github.com:Arrow-air/benchmarks.git"
              - svn_url                                 = "https://github.com/Arrow-air/benchmarks"
              - template                                = []
              - topics                                  = []
              - visibility                              = "public"
              - vulnerability_alerts                    = true
            }
        }
      - cla-bot         = {
          - branch         = {}
          - branch_default = {
              - branch     = "main"
              - id         = "cla-bot"
              - repository = "cla-bot"
            }
          - repository     = {
              - allow_auto_merge                        = false
              - allow_merge_commit                      = true
              - allow_rebase_merge                      = true
              - allow_squash_merge                      = true
              - archive_on_destroy                      = null
              - archived                                = false
              - auto_init                               = true
              - branches                                = [
                  - {
                      - name      = "main"
                      - protected = true
                    },
                ]
              - default_branch                          = "main"
              - delete_branch_on_merge                  = true
              - description                             = "Arrow CLA bot API code and deployment files"
              - etag                                    = "W/\"df59ca3afe134a880a8ab2c2041db4e1a5300b3e86da46c3c1e57831de21ac07\""
              - full_name                               = "Arrow-air/cla-bot"
              - git_clone_url                           = "git://github.com/Arrow-air/cla-bot.git"
              - gitignore_template                      = null
              - has_downloads                           = false
              - has_issues                              = true
              - has_projects                            = true
              - has_wiki                                = true
              - homepage_url                            = ""
              - html_url                                = "https://github.com/Arrow-air/cla-bot"
              - http_clone_url                          = "https://github.com/Arrow-air/cla-bot.git"
              - id                                      = "cla-bot"
              - ignore_vulnerability_alerts_during_read = null
              - is_template                             = false
              - license_template                        = null
              - merge_commit_message                    = "PR_TITLE"
              - merge_commit_title                      = "MERGE_MESSAGE"
              - name                                    = "cla-bot"
              - node_id                                 = "R_kgDOHTAbhQ"
              - pages                                   = []
              - private                                 = false
              - repo_id                                 = 489692037
              - squash_merge_commit_message             = "COMMIT_MESSAGES"
              - squash_merge_commit_title               = "COMMIT_OR_PR_TITLE"
              - ssh_clone_url                           = "git@github.com:Arrow-air/cla-bot.git"
              - svn_url                                 = "https://github.com/Arrow-air/cla-bot"
              - template                                = []
              - topics                                  = []
              - visibility                              = "public"
              - vulnerability_alerts                    = true
            }
        }
      - clabot-config   = {
          - branch         = {}
          - branch_default = {
              - branch     = "main"
              - id         = "clabot-config"
              - repository = "clabot-config"
            }
          - repository     = {
              - allow_auto_merge                        = false
              - allow_merge_commit                      = true
              - allow_rebase_merge                      = true
              - allow_squash_merge                      = true
              - archive_on_destroy                      = null
              - archived                                = false
              - auto_init                               = true
              - branches                                = [
                  - {
                      - name      = "main"
                      - protected = false
                    },
                ]
              - default_branch                          = "main"
              - delete_branch_on_merge                  = true
              - description                             = "Arrow CLA bot global configuration"
              - etag                                    = "W/\"c359f29abbcc83a4c2e1a2ccadef017aec367ff4bd4f0cbdb514e33f92db01c8\""
              - full_name                               = "Arrow-air/clabot-config"
              - git_clone_url                           = "git://github.com/Arrow-air/clabot-config.git"
              - gitignore_template                      = null
              - has_downloads                           = false
              - has_issues                              = true
              - has_projects                            = true
              - has_wiki                                = true
              - homepage_url                            = ""
              - html_url                                = "https://github.com/Arrow-air/clabot-config"
              - http_clone_url                          = "https://github.com/Arrow-air/clabot-config.git"
              - id                                      = "clabot-config"
              - ignore_vulnerability_alerts_during_read = null
              - is_template                             = false
              - license_template                        = null
              - merge_commit_message                    = "PR_TITLE"
              - merge_commit_title                      = "MERGE_MESSAGE"
              - name                                    = "clabot-config"
              - node_id                                 = "R_kgDOHTWz9g"
              - pages                                   = []
              - private                                 = true
              - repo_id                                 = 490058742
              - squash_merge_commit_message             = "COMMIT_MESSAGES"
              - squash_merge_commit_title               = "COMMIT_OR_PR_TITLE"
              - ssh_clone_url                           = "git@github.com:Arrow-air/clabot-config.git"
              - svn_url                                 = "https://github.com/Arrow-air/clabot-config"
              - template                                = []
              - topics                                  = null
              - visibility                              = "private"
              - vulnerability_alerts                    = true
            }
        }
      - se-services     = {
          - branch         = {
              - develop = {
                  - branch        = "develop"
                  - etag          = "W/\"d04967741e1035553e51fee43725cd6f944255f95880f9978fd138fd00b660e1\""
                  - id            = "se-services:develop"
                  - ref           = "refs/heads/develop"
                  - repository    = "se-services"
                  - sha           = "52fd1ddceab3bbd6d77decd85593d8ebf004537b"
                  - source_branch = "main"
                  - source_sha    = "8423dcf685131ced3a40c709d74aa61db610f414"
                }
            }
          - branch_default = {
              - branch     = "develop"
              - id         = "se-services"
              - repository = "se-services"
            }
          - repository     = {
              - allow_auto_merge                        = false
              - allow_merge_commit                      = true
              - allow_rebase_merge                      = true
              - allow_squash_merge                      = true
              - archive_on_destroy                      = null
              - archived                                = false
              - auto_init                               = true
              - branches                                = [
                  - {
                      - name      = "main"
                      - protected = false
                    },
                ]
              - default_branch                          = "main"
              - delete_branch_on_merge                  = true
              - description                             = "Systems Engineering documentation for Aerial Mobility Services"
              - etag                                    = "W/\"e897ef88679e2e4670bcf0ae6585fb16c72f6e6d0e9d8588c89d650310714a4b\""
              - full_name                               = "Arrow-air/se-services"
              - git_clone_url                           = "git://github.com/Arrow-air/se-services.git"
              - gitignore_template                      = null
              - has_downloads                           = false
              - has_issues                              = true
              - has_projects                            = true
              - has_wiki                                = true
              - homepage_url                            = ""
              - html_url                                = "https://github.com/Arrow-air/se-services"
              - http_clone_url                          = "https://github.com/Arrow-air/se-services.git"
              - id                                      = "se-services"
              - ignore_vulnerability_alerts_during_read = null
              - is_template                             = false
              - license_template                        = null
              - merge_commit_message                    = "PR_TITLE"
              - merge_commit_title                      = "MERGE_MESSAGE"
              - name                                    = "se-services"
              - node_id                                 = "R_kgDOH6H84A"
              - pages                                   = []
              - private                                 = false
              - repo_id                                 = 530709728
              - squash_merge_commit_message             = "COMMIT_MESSAGES"
              - squash_merge_commit_title               = "COMMIT_OR_PR_TITLE"
              - ssh_clone_url                           = "git@github.com:Arrow-air/se-services.git"
              - svn_url                                 = "https://github.com/Arrow-air/se-services"
              - template                                = []
              - topics                                  = null
              - visibility                              = "public"
              - vulnerability_alerts                    = true
            }
        }
      - tool-simulation = {
          - branch         = {
              - develop = {
                  - branch        = "develop"
                  - etag          = "W/\"c4737c39abafaf924e104d1cda2a7d24c0ae56035060de6e2b01edf19a504cf2\""
                  - id            = "tool-simulation:develop"
                  - ref           = "refs/heads/develop"
                  - repository    = "tool-simulation"
                  - sha           = "18453723d99609bb285326f2d17011f369bedb2c"
                  - source_branch = "main"
                  - source_sha    = "ed6ea96ba6a2d35ae72888802472d50b8cc9ccc6"
                }
            }
          - branch_default = {
              - branch     = "develop"
              - id         = "tool-simulation"
              - repository = "tool-simulation"
            }
          - repository     = {
              - allow_auto_merge                        = false
              - allow_merge_commit                      = true
              - allow_rebase_merge                      = true
              - allow_squash_merge                      = true
              - archive_on_destroy                      = null
              - archived                                = false
              - auto_init                               = true
              - branches                                = [
                  - {
                      - name      = "develop"
                      - protected = true
                    },
                  - {
                      - name      = "main"
                      - protected = true
                    },
                ]
              - default_branch                          = "develop"
              - delete_branch_on_merge                  = true
              - description                             = "Simulated agents to load test the Arrow Services"
              - etag                                    = "W/\"79be8a3a93bdaff6aabed168bee6e0fc852af751957dd11405b8a80245d38b5d\""
              - full_name                               = "Arrow-air/tool-simulation"
              - git_clone_url                           = "git://github.com/Arrow-air/tool-simulation.git"
              - gitignore_template                      = null
              - has_downloads                           = false
              - has_issues                              = true
              - has_projects                            = true
              - has_wiki                                = true
              - homepage_url                            = ""
              - html_url                                = "https://github.com/Arrow-air/tool-simulation"
              - http_clone_url                          = "https://github.com/Arrow-air/tool-simulation.git"
              - id                                      = "tool-simulation"
              - ignore_vulnerability_alerts_during_read = null
              - is_template                             = false
              - license_template                        = null
              - merge_commit_message                    = "PR_TITLE"
              - merge_commit_title                      = "MERGE_MESSAGE"
              - name                                    = "tool-simulation"
              - node_id                                 = "R_kgDOH_Z3bw"
              - pages                                   = []
              - private                                 = false
              - repo_id                                 = 536246127
              - squash_merge_commit_message             = "COMMIT_MESSAGES"
              - squash_merge_commit_title               = "COMMIT_OR_PR_TITLE"
              - ssh_clone_url                           = "git@github.com:Arrow-air/tool-simulation.git"
              - svn_url                                 = "https://github.com/Arrow-air/tool-simulation"
              - template                                = []
              - topics                                  = []
              - visibility                              = "public"
              - vulnerability_alerts                    = true
            }
        }
      - tools           = {
          - branch         = {}
          - branch_default = {
              - branch     = "main"
              - id         = "tools"
              - repository = "tools"
            }
          - repository     = {
              - allow_auto_merge                        = false
              - allow_merge_commit                      = true
              - allow_rebase_merge                      = true
              - allow_squash_merge                      = true
              - archive_on_destroy                      = null
              - archived                                = false
              - auto_init                               = true
              - branches                                = [
                  - {
                      - name      = "main"
                      - protected = true
                    },
                  - {
                      - name      = "owlot/feat-flake8-plugins"
                      - protected = false
                    },
                ]
              - default_branch                          = "main"
              - delete_branch_on_merge                  = true
              - description                             = "Software used for Arrow engineering"
              - etag                                    = "W/\"b69618d3d150274b197cf2955e4d5c108a260c379a95884943d54652689d11bd\""
              - full_name                               = "Arrow-air/tools"
              - git_clone_url                           = "git://github.com/Arrow-air/tools.git"
              - gitignore_template                      = null
              - has_downloads                           = false
              - has_issues                              = true
              - has_projects                            = true
              - has_wiki                                = true
              - homepage_url                            = ""
              - html_url                                = "https://github.com/Arrow-air/tools"
              - http_clone_url                          = "https://github.com/Arrow-air/tools.git"
              - id                                      = "tools"
              - ignore_vulnerability_alerts_during_read = null
              - is_template                             = false
              - license_template                        = null
              - merge_commit_message                    = "PR_TITLE"
              - merge_commit_title                      = "MERGE_MESSAGE"
              - name                                    = "tools"
              - node_id                                 = "R_kgDOHn-Jfw"
              - pages                                   = []
              - private                                 = false
              - repo_id                                 = 511674751
              - squash_merge_commit_message             = "COMMIT_MESSAGES"
              - squash_merge_commit_title               = "COMMIT_OR_PR_TITLE"
              - ssh_clone_url                           = "git@github.com:Arrow-air/tools.git"
              - svn_url                                 = "https://github.com/Arrow-air/tools"
              - template                                = []
              - topics                                  = []
              - visibility                              = "public"
              - vulnerability_alerts                    = true
            }
        }
      - website         = {
          - branch         = {
              - staging = {
                  - branch        = "staging"
                  - etag          = "W/\"bc3fe4f875faf5ded891fda74a10ec4c111ad33475dcbca92b843cbcc7ff78a8\""
                  - id            = "website:staging"
                  - ref           = "refs/heads/staging"
                  - repository    = "website"
                  - sha           = "03c724e372fb6941a498c7c7e2a482400864f2f8"
                  - source_branch = "main"
                  - source_sha    = null
                }
            }
          - branch_default = {
              - branch     = "staging"
              - id         = "website"
              - repository = "website"
            }
          - repository     = {
              - allow_auto_merge                        = false
              - allow_merge_commit                      = true
              - allow_rebase_merge                      = true
              - allow_squash_merge                      = true
              - archive_on_destroy                      = null
              - archived                                = false
              - auto_init                               = true
              - branches                                = [
                  - {
                      - name      = "main"
                      - protected = true
                    },
                  - {
                      - name      = "staging"
                      - protected = true
                    },
                ]
              - default_branch                          = "staging"
              - delete_branch_on_merge                  = true
              - description                             = "Arrowair website and documentation with Docusaurus"
              - etag                                    = "W/\"f51c6cdda82db26c967b57b213b5d3edfebb07ae6d34cc86e9358aa3de9e4998\""
              - full_name                               = "Arrow-air/website"
              - git_clone_url                           = "git://github.com/Arrow-air/website.git"
              - gitignore_template                      = null
              - has_downloads                           = false
              - has_issues                              = true
              - has_projects                            = true
              - has_wiki                                = true
              - homepage_url                            = ""
              - html_url                                = "https://github.com/Arrow-air/website"
              - http_clone_url                          = "https://github.com/Arrow-air/website.git"
              - id                                      = "website"
              - ignore_vulnerability_alerts_during_read = null
              - is_template                             = false
              - license_template                        = null
              - merge_commit_message                    = "PR_TITLE"
              - merge_commit_title                      = "MERGE_MESSAGE"
              - name                                    = "website"
              - node_id                                 = "R_kgDOGdyvzA"
              - pages                                   = []
              - private                                 = false
              - repo_id                                 = 433893324
              - squash_merge_commit_message             = "COMMIT_MESSAGES"
              - squash_merge_commit_title               = "COMMIT_OR_PR_TITLE"
              - ssh_clone_url                           = "git@github.com:Arrow-air/website.git"
              - svn_url                                 = "https://github.com/Arrow-air/website"
              - template                                = []
              - topics                                  = []
              - visibility                              = "public"
              - vulnerability_alerts                    = true
            }
        }
    } -> null

```

</details>

*Pusher: @owlot, Action: `pull_request`, Working Directory: ``, Workflow: `Terraform`*